Revit 2026 API

# FamilySymbolGetStructuralSection Method

---

Gets the structural section from element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public StructuralSection GetStructuralSection()
```
```vb
Public Function GetStructuralSection As StructuralSection
```
```cpp
public:
StructuralSection^ GetStructuralSection()
```
```fsharp
member GetStructuralSection : unit -> StructuralSection
```

#### Return Value

StructuralSection The structural section.  if the family symbol does not contain a structural section.

Only beams, braces and structural columns can have a structural section. To check if the element can have structural section use the CanHaveStructuralSection method.

#### Reference

FamilySymbol Class

Autodesk.Revit.DB Namespace